app/controllers/groups_controller.rb

  def create
    @group = current_user.groups.new(group_params)

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Tufoin"], ["icon", "Dangote"], ["user_id", nil], ["created_at", "2022-02-15 15:33:36.923881"], ["updated_at", "2022-02-15 15:33:36.923881"]]

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "icon" = $1, "updated_at" = $2 WHERE "groups"."id" = $3

  def destroy
    @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 2]]