app/controllers/operations_controller.rb

  def index
    @operations = Operation.all
---
SELECT "operations".* FROM "operations"